Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.ExaggerationDirections Enumeration
 The direction of the exaggeration.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ExaggerationDirections
Public Enumeration ExaggerationDirections
Members
Member name | Value | Description
LeftDown | 1 |  Left / Down.
RightUp | 2 |  Right / Up.
Both | 3 |  Both Left/Down and Right / Up.
See Also
Reference
Tekla.Structures.Drawing Namespace